In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__ # 0.24.2

'0.24.2'

- Getting Started: http://pandas.pydata.org/pandas-docs/stable/getting_started/index.html
    - 10 Minutes to pandas: http://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html
    - Pandas Cheat Sheet: http://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

# Design

http://pandas.pydata.org/pandas-docs/stable/getting_started/overview.html

## Primary Data Structures

| Dimensions | Name | Description |
| ---------- | ---- | ----------- |
| 1 | Series | **homogeneously**-typed array |
| 2	| DataFrame | size-mutable tabular structure with potentially **heterogeneously**-typed column |

- Pandas objects (Index, Series, DataFrame) can be thought of as **containers for arrays**, which hold the actual data and do the actual computation. For many types, **the underlying array is a numpy.ndarray**
- **DataFrame is a container for Series, and Series is a container for scalars**
- insert and remove objects from these containers in a dictionary-like fashion
- the axes are intended to lend more semantic meaning to the data

```python
for col in df.columns:
    series = df[col]
    # do something with series
```

## Mutability and copying of data

- All pandas data structures are **value-mutable** (the values they contain can be altered) but **not always size-mutable**.The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame.

- However, the vast majority of methods produce new objects and leave the input data untouched. In general we like to **favor immutability where sensible**.

## Index

https://pandas.pydata.org/pandas-docs/version/0.24.2/reference/indexing.html#index

`pd.Index`: Immutable ndarray implementing an ordered, sliceable set.

In [3]:
display(pd.Index([1,2,3]))
display(pd.Index([1,3,2]))
display(pd.Index([1,2,3])[:2])
display(pd.Index([1,2,'a']))
display(pd.Index(['a','b','c']))
display(pd.Index(['a','b','b']))
display(pd.DatetimeIndex(['2000-01','2000-03','2001-01']))
arrays = [[1, 1, 2, 2], ['red', 'blue', 'red', 'blue']]
display(pd.MultiIndex.from_arrays(arrays, names=('number', 'color')))

Int64Index([1, 2, 3], dtype='int64')

Int64Index([1, 3, 2], dtype='int64')

Int64Index([1, 2], dtype='int64')

Index([1, 2, 'a'], dtype='object')

Index(['a', 'b', 'c'], dtype='object')

Index(['a', 'b', 'b'], dtype='object')

DatetimeIndex(['2000-01-01', '2000-03-01', '2001-01-01'], dtype='datetime64[ns]', freq=None)

MultiIndex(levels=[[1, 2], ['blue', 'red']],
           codes=[[0, 0, 1, 1], [1, 0, 1, 0]],
           names=['number', 'color'])

## Series

https://pandas.pydata.org/pandas-docs/stable/reference/series.html

index + single column data

In [4]:
sr = pd.Series(data=[1,2], index=['row_1', 'row_2'])
display(sr)
display(type(sr))

row_1    1
row_2    2
dtype: int64

pandas.core.series.Series

## DataFrame

https://pandas.pydata.org/pandas-docs/stable/reference/frame.html

index + column + tabular data

In [5]:
df = pd.DataFrame(data=[1,2], index=['row_1', 'row_2'], columns=['col_1'])
display(df)

df = pd.DataFrame(data=['foo',2], index=[('a',1), ('b',2)], columns=['col_1'])
display(df)

df = pd.DataFrame(data=[[1,2],[2,2]], index=[('a',1), ('b',2)], columns=['col_1', 'col_2'])
display(df)

       col_1
row_1      1
row_2      2

       col_1
(a, 1)   foo
(b, 2)     2

        col_1  col_2
(a, 1)      1      2
(b, 2)      2      2

### Conversion: Dict

In [6]:
# dict to dataframe

df = pd.DataFrame({'col_1': [10, 'aa', (1,'e'), 30, 45],
                   'col_2': [13, 'cc', (3,'f'), 33, 48],
                   'col_3': [17, 'dd', (5,'g'), 37, 52]})
display(df)

data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
df = pd.DataFrame.from_dict(data, orient='columns')
display(df)

data = {'row_1': [3, 2, 1, 0], 'row_2': ['a', 'b', 'c', 'd']}
df = pd.DataFrame.from_dict(data, orient='index')
display(df)

    col_1   col_2   col_3
0      10      13      17
1      aa      cc      dd
2  (1, e)  (3, f)  (5, g)
3      30      33      37
4      45      48      52

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

       0  1  2  3
row_1  3  2  1  0
row_2  a  b  c  d

In [7]:
# dataframe to dict

df = pd.DataFrame({'col_1': [10, 'aa', (1,'e'), 30, 45],
                   'col_2': [13, 'cc', (3,'f'), 33, 48],
                   'col_3': [17, 'dd', (5,'g'), 37, 52]})
display(df)

print('----------\norient=dict:')
display( df.to_dict(orient='dict')) # default
print('orient=list:')
display(df.to_dict(orient='list'))

print('----------\norient=records:')
display(df.to_dict(orient='records'))
print('orient=index:')
display(df.to_dict(orient='index'))

print('----------\norient=split:')
display(df.to_dict(orient='split'))

print('----------\norient=series:')
display(df.to_dict(orient='series'))

    col_1   col_2   col_3
0      10      13      17
1      aa      cc      dd
2  (1, e)  (3, f)  (5, g)
3      30      33      37
4      45      48      52

----------
orient=dict:

{'col_1': {0: 10, 1: 'aa', 2: (1, 'e'), 3: 30, 4: 45},
 'col_2': {0: 13, 1: 'cc', 2: (3, 'f'), 3: 33, 4: 48},
 'col_3': {0: 17, 1: 'dd', 2: (5, 'g'), 3: 37, 4: 52}}

orient=list:

{'col_1': [10, 'aa', (1, 'e'), 30, 45],
 'col_2': [13, 'cc', (3, 'f'), 33, 48],
 'col_3': [17, 'dd', (5, 'g'), 37, 52]}

----------
orient=records:

[{'col_1': 10, 'col_2': 13, 'col_3': 17},
 {'col_1': 'aa', 'col_2': 'cc', 'col_3': 'dd'},
 {'col_1': (1, 'e'), 'col_2': (3, 'f'), 'col_3': (5, 'g')},
 {'col_1': 30, 'col_2': 33, 'col_3': 37},
 {'col_1': 45, 'col_2': 48, 'col_3': 52}]

orient=index:

{0: {'col_1': 10, 'col_2': 13, 'col_3': 17},
 1: {'col_1': 'aa', 'col_2': 'cc', 'col_3': 'dd'},
 2: {'col_1': (1, 'e'), 'col_2': (3, 'f'), 'col_3': (5, 'g')},
 3: {'col_1': 30, 'col_2': 33, 'col_3': 37},
 4: {'col_1': 45, 'col_2': 48, 'col_3': 52}}

----------
orient=split:

{'index': [0, 1, 2, 3, 4],
 'columns': ['col_1', 'col_2', 'col_3'],
 'data': [[10, 13, 17],
  ['aa', 'cc', 'dd'],
  [(1, 'e'), (3, 'f'), (5, 'g')],
  [30, 33, 37],
  [45, 48, 52]]}

----------
orient=series:

{'col_1': 0        10
 1        aa
 2    (1, e)
 3        30
 4        45
 Name: col_1, dtype: object, 'col_2': 0        13
 1        cc
 2    (3, f)
 3        33
 4        48
 Name: col_2, dtype: object, 'col_3': 0        17
 1        dd
 2    (5, g)
 3        37
 4        52
 Name: col_3, dtype: object}

### Conversion: Numpy Array

In [8]:
# array to dataframe
display(pd.DataFrame(np.array([3,2,1,0])))
display(pd.DataFrame(np.array([[3,2],[1,0]])))

   0
0  3
1  2
2  1
3  0

   0  1
0  3  2
1  1  0

In [9]:
# dataframe to array
df = pd.DataFrame({'col_1': [10, 'aa', (1,'e'), 30, 45],
                   'col_2': [13, 'cc', (3,'f'), 33, 48],
                   'col_3': [17, 'dd', (5,'g'), 37, 52]})
display(df)
display(df.to_numpy()) # Depreciated: .values / as_matrix()
display(df.to_numpy().T) 
display(df.T.to_numpy())

    col_1   col_2   col_3
0      10      13      17
1      aa      cc      dd
2  (1, e)  (3, f)  (5, g)
3      30      33      37
4      45      48      52

array([[10, 13, 17],
       ['aa', 'cc', 'dd'],
       [(1, 'e'), (3, 'f'), (5, 'g')],
       [30, 33, 37],
       [45, 48, 52]], dtype=object)

array([[10, 'aa', (1, 'e'), 30, 45],
       [13, 'cc', (3, 'f'), 33, 48],
       [17, 'dd', (5, 'g'), 37, 52]], dtype=object)

array([[10, 'aa', (1, 'e'), 30, 45],
       [13, 'cc', (3, 'f'), 33, 48],
       [17, 'dd', (5, 'g'), 37, 52]], dtype=object)

### View

In [10]:
# reset_index

df = pd.DataFrame(data=[1,2], index=[('a',1), ('b',2)], columns=['col_1'])
display(df)

display(df.reset_index())
display(df.reset_index(drop=True))

        col_1
(a, 1)      1
(b, 2)      2

    index  col_1
0  (a, 1)      1
1  (b, 2)      2

   col_1
0      1
1      2

In [11]:
# rename column
display(df.rename(index=str, columns={"col_1": "x", "col_2": "y"}))

          x
('a', 1)  1
('b', 2)  2

In [12]:
# Transpose
display(df.T)

       (a, 1)  (b, 2)
col_1       1       2

# File IO

## Input

- `pd.read_json`
- `pd.read_excel`
- `pd.read_csv`
- `pd.read_pickle` # for pandas objects or other objects such as python dict

More: https://pandas.pydata.org/pandas-docs/stable/reference/io.html

## Output

- `df.to_csv`
- `df.to_dict(orient=)`
- `df.to_excel`
- `df.to_pickle`

More: https://pandas.pydata.org/pandas-docs/stable/reference/frame.html#serialization-io-conversion

### Excel with Style

StyleFrame: https://styleframe.readthedocs.io/en/0.2/#

In [ ]:
# Excel with style
from StyleFrame import StyleFrame, Styler

sf = StyleFrame.read_excel('xxx.xlsx', sheet_name='Sheet1') #, read_style=True / StyleFrame support only .xlsx

font_blue = Styler(font_color='blue')
font_red = Styler(font_color='red')

for col_name in sf.columns:
    sf.apply_style_by_indexes(indexes_to_style=sf[sf[col_name].isin(some_list)], # decide rows
                              styler_obj=font_blue,
                              cols_to_style=col_name) # decide cols
    sf.apply_style_by_indexes(indexes_to_style=sf[sf[col_name].isin(another_list)],
                              styler_obj=font_red,
                              cols_to_style=col_name)

sf.to_excel('xxx_styled.xlsx').save()

# Indexing / Selecting / Slicing

https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html

index的label和integer position

## [ ]

- series: select row
- dataframe: select column

In [13]:
sr = pd.Series(data=['aa','bb','cc', 'dd'], index=['a',1,2,3])
display(sr)
display(sr[pd.Index([1,3,2])])
display(sr[[1,3,2]])
display(sr[[1,'a',2]])

a    aa
1    bb
2    cc
3    dd
dtype: object

1    bb
3    dd
2    cc
dtype: object

1    bb
3    dd
2    cc
dtype: object

1    bb
a    aa
2    cc
dtype: object

In [14]:
df = pd.DataFrame(data=[[1,2],[3,4]], index=['row_1', 'row_2'], columns=['col_1','col_2'])
display(df)
display(df[['col_1']]) # column
# df[['row_1', 'row_2']] Error

       col_1  col_2
row_1      1      2
row_2      3      4

       col_1
row_1      1
row_2      3

## loc / iloc

### single index

In [15]:
sr = pd.Series(data=['aa','bb','cc', 'dd'], index=['a',1,2,3])
display(sr)

a    aa
1    bb
2    cc
3    dd
dtype: object

In [16]:
df = pd.DataFrame(data=[1,2], index=['row_1', 'row_2'], columns=['col_1'])
display(df)
display(df.loc[['row_1', 'row_2']])

       col_1
row_1      1
row_2      2

       col_1
row_1      1
row_2      2

In [17]:
try:
    df.loc[('row_1', 'row_2')] # for multiindex: https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html
except Exception as e:
    print(type(e), e)

<class 'KeyError'> 'row_2'

### tuple index

In [18]:
df = pd.DataFrame(data=[1,2], index=[('a',1), ('b',2)], columns=['col_1'])
display(df)

        col_1
(a, 1)      1
(b, 2)      2

In [ ]:
df.loc[('a',1)] # KeyError: 'a'
df.loc[('a',1),] # KeyError: "None of [('a', 1)] are in the [index]"

In [19]:
display(df.loc[[('a',1)],])
display(df.loc[[('a',1),],])
display(df.loc[[('a',1), ('b',2)],])

        col_1
(a, 1)      1

        col_1
(a, 1)      1

        col_1
(a, 1)      1
(b, 2)      2

In [20]:
display(df.loc[[('a',1),], 'col_1'])

(a, 1)    1
Name: col_1, dtype: int64

### hierarchical index (MultiIndex)

https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html

In [21]:
arrays = [np.array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux']),
          np.array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'])] 
df = pd.DataFrame(np.random.randn(8, 4), index=arrays)
display(df)

                0         1         2         3
bar one  0.084010  0.448388  0.221175 -0.851327
    two -0.111577 -0.416242  0.470984 -1.161720
baz one -0.536095 -0.227912  0.683266  0.009823
    two  2.772779  2.812283  1.010860 -1.774197
foo one  0.296005  0.024984 -0.485968  0.921718
    two -0.248626  0.868039 -0.617423  0.612953
qux one -0.695896 -0.325554  0.564617 -1.511105
    two  0.271633 -1.354904  1.143468 -0.917606

In [22]:
display(df.loc[('baz', 'two')]) # series
display(df.loc[[('baz', 'two')]]) # dataframe
display(df.loc[[('baz', 'two'), ('foo', 'one')]]) # dataframe

0    2.772779
1    2.812283
2    1.010860
3   -1.774197
Name: (baz, two), dtype: float64

                0         1        2         3
baz two  2.772779  2.812283  1.01086 -1.774197

                0         1         2         3
baz two  2.772779  2.812283  1.010860 -1.774197
foo one  0.296005  0.024984 -0.485968  0.921718

### iloc

In [23]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                   'BBB': [10, 20, 30, 40],
                   'CCC': [100, 50, -30, -50]})
display(df)

display(df.iloc[0]) # series
display(df.iloc[-1])

display(df.iloc[0:2]) # dataframe
display(df.iloc[1:])
display(df.iloc[-1:])
display(df.iloc[::2])

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

AAA      4
BBB     10
CCC    100
Name: 0, dtype: int64

AAA     7
BBB    40
CCC   -50
Name: 3, dtype: int64

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

   AAA  BBB  CCC
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
3    7   40  -50

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

## Boolean Filtering

In [24]:
df = pd.DataFrame(data=[[1,2],[2,1]], index=[('a',1), ('b',2)], columns=['col_1', 'col_2'])
display(df)

        col_1  col_2
(a, 1)      1      2
(b, 2)      2      1

In [25]:
display(type(df['col_1'] == 1))
display(df['col_1'] == 1)
display(df[df['col_1'] == 1])

pandas.core.series.Series

(a, 1)     True
(b, 2)    False
Name: col_1, dtype: bool

        col_1  col_2
(a, 1)      1      2

In [26]:
# combine

bool_1 = df['col_1'] == 2
bool_2 = df['col_2'] == 1
display(bool_1)
display(bool_2)
display(bool_1 & bool_2)
display(df[bool_1 & bool_2])

(a, 1)    False
(b, 2)     True
Name: col_1, dtype: bool

(a, 1)    False
(b, 2)     True
Name: col_2, dtype: bool

(a, 1)    False
(b, 2)     True
dtype: bool

        col_1  col_2
(b, 2)      2      1

In [27]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                   'BBB': [10, 20, 30, 40],
                   'CCC': [100, 50, -30, -50]})
display(df)

display(df[(df.AAA <= 6) & (df.index.isin([0, 2, 4]))])

display(df.loc[(df['BBB'] > 25) | (df['CCC'] >= -40), 'AAA'])
display(df)

df.loc[(df['BBB'] > 25) | (df['CCC'] >= -40), 'AAA'] = 1
display(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    1   10  100
1    1   20   50
2    1   30  -30
3    1   40  -50

## Sampling

In [28]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                   'BBB': [10, 20, 30, 40],
                   'CCC': [100, 50, -30, -50]})
display(df)
display(df.sample(n=2))
display(df.sample(n=2, axis=1))

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
2    6   30  -30
1    5   20   50

   BBB  CCC
0   10  100
1   20   50
2   30  -30
3   40  -50

# Merge / Join / Concat

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

- `.add()`
- `.merge()`
- `.join()`

# Math

https://pandas.pydata.org/pandas-docs/stable/reference/frame.html#computations-descriptive-stats

## Unary Operation

In [29]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                   'BBB': [10, 20, 30, 40],
                   'CCC': [100, 50, -30, -50]})
display(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

### Series

In [30]:
display(sum(df['AAA'])) # == df['AAA'].sum()
display(max(df['AAA'])) # == df['AAA'].max()
display(df['AAA'].mean())
display(df['AAA'].value_counts()) # series

22

7

5.5

7    1
6    1
5    1
4    1
Name: AAA, dtype: int64

### DataFrame

In [31]:
display(df.sum()) # series
display(df * 2) # dataframe
display(df.describe()) # dataframe

AAA     22
BBB    100
CCC     70
dtype: int64

   AAA  BBB  CCC
0    8   20  200
1   10   40  100
2   12   60  -60
3   14   80 -100

            AAA        BBB         CCC
count  4.000000   4.000000    4.000000
mean   5.500000  25.000000   17.500000
std    1.290994  12.909944   69.940451
min    4.000000  10.000000  -50.000000
25%    4.750000  17.500000  -35.000000
50%    5.500000  25.000000   10.000000
75%    6.250000  32.500000   62.500000
max    7.000000  40.000000  100.000000

## Binary Operation

In [32]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                   'BBB': [10, 20, 30, 40],
                   'CCC': [100, 50, -30, -50]})
display(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

### Series

In [33]:
display(df['AAA'] + df['BBB'])
display(df['AAA'] * df['BBB'])

import scipy.spatial.distance as distance
display(1 - distance.cosine(df['AAA'], df['BBB']))

0    14
1    25
2    36
3    47
dtype: int64

0     40
1    100
2    180
3    280
dtype: int64

0.9759000729485331

### DataFrame

In [34]:
display(df + df)
display(df / df)
display(df.T @ df) # Matrix dot product

   AAA  BBB  CCC
0    8   20  200
1   10   40  100
2   12   60  -60
3   14   80 -100

   AAA  BBB  CCC
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0

     AAA   BBB    CCC
AAA  126   600    120
BBB  600  3000   -900
CCC  120  -900  15900

# Iteration


do not have to convert to list/dict, Pandas can do iteration - performance

In [35]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                   'BBB': [10, 20, 30, 40],
                   'CCC': [100, 50, -30, -50]})
display(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

## Along axis

- `.iteritems()`
- `.iterrows()`
- `.itertuples()`

In [36]:
for col in df:
    print(col)

AAA
BBB
CCC

In [37]:
for columns, series in df.iteritems():
    print(columns)
    print(series)

AAA
0    4
1    5
2    6
3    7
Name: AAA, dtype: int64
BBB
0    10
1    20
2    30
3    40
Name: BBB, dtype: int64
CCC
0    100
1     50
2    -30
3    -50
Name: CCC, dtype: int64

In [38]:
for index, series in df.iterrows():
    print(index)
    print(series)

for row in df.itertuples():
    print(row)

0
AAA      4
BBB     10
CCC    100
Name: 0, dtype: int64
1
AAA     5
BBB    20
CCC    50
Name: 1, dtype: int64
2
AAA     6
BBB    30
CCC   -30
Name: 2, dtype: int64
3
AAA     7
BBB    40
CCC   -50
Name: 3, dtype: int64
Pandas(Index=0, AAA=4, BBB=10, CCC=100)
Pandas(Index=1, AAA=5, BBB=20, CCC=50)
Pandas(Index=2, AAA=6, BBB=30, CCC=-30)
Pandas(Index=3, AAA=7, BBB=40, CCC=-50)

## Apply / Map

https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas

- `map` works element-wise on a Series.
- `applymap` works element-wise on a DataFrame
- `apply` works on a row / column basis of a DataFrame (`df.apply()`), also works on series(`sr.apply()`)
    - If func returns a scalar or a list, `apply(func)` returns a Series.
    - If func returns a Series, `apply(func)` returns a DataFrame.


- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.map.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.applymap.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.apply.html

In [39]:
import math

df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                   'BBB': [10, 20, 30, 40],
                   'CCC': [100, 50, -30, -50]})
display(df)
display(df['AAA'].apply(math.sqrt))
display(df.apply(np.sqrt, axis=0))

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

0    2.000000
1    2.236068
2    2.449490
3    2.645751
Name: AAA, dtype: float64

        AAA       BBB        CCC
0  2.000000  3.162278  10.000000
1  2.236068  4.472136   7.071068
2  2.449490  5.477226        NaN
3  2.645751  6.324555        NaN

In [40]:
# apply + lambda
display(df)
display(df['AAA'].apply(lambda x: pd.Series([x] * 5)))
display(df.apply(lambda x: x.loc[0] + 1, axis=0)) # index (row), axis=0
display(df.apply(lambda x: x, axis=1)) # column, axis=1
display(df.apply(lambda x: x.loc['AAA'] + 1, axis=1)) # column
display(df.apply(lambda x: x.loc['AAA'] + x.loc['BBB'], axis=1)) # multi-columns, same as: df['AAA'] + df['BBB']
display(df.apply(lambda x: max([x['BBB'], x['CCC']]), axis=1))

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   0  1  2  3  4
0  4  4  4  4  4
1  5  5  5  5  5
2  6  6  6  6  6
3  7  7  7  7  7

AAA      5
BBB     11
CCC    101
dtype: int64

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

0    5
1    6
2    7
3    8
dtype: int64

0    14
1    25
2    36
3    47
dtype: int64

0    100
1     50
2     30
3     40
dtype: int64

In [41]:
# Normalize

df = pd.DataFrame({'AAA': [4, 5, 6, 7],
                   'BBB': [10, 20, 30, 40],
                   'CCC': [100, 50, -30, -50]})
display(df)
df['CCC'] = df['CCC'].apply(lambda x: x/max(df['CCC'])) 
display(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   10  1.0
1    5   20  0.5
2    6   30 -0.3
3    7   40 -0.5

### Apply with Progress Bar

In [42]:
from tqdm import tqdm

tqdm.pandas()

df.progress_apply(lambda x: max([x['BBB'], x['CCC']]), axis=1)

100%|██████████| 4/4 [00:00<00:00, 1426.63it/s]

0    10.0
1    20.0
2    30.0
3    40.0
dtype: float64

In [43]:
from tqdm.autonotebook import tqdm

tqdm.pandas()

df.progress_apply(lambda x: max([x['BBB'], x['CCC']]), axis=1)

/root/anaconda3/lib/python3.7/site-packages/tqdm/autonotebook/__init__.py:14: TqdmExperimentalWarning: Using `tqdm.autonotebook.tqdm` in notebook mode. Use `tqdm.tqdm` instead to force console mode (e.g. in jupyter console)
  " (e.g. in jupyter console)", TqdmExperimentalWarning)

HBox(children=(IntProgress(value=0, max=4), HTML(value='')))

0    10.0
1    20.0
2    30.0
3    40.0
dtype: float64

## Group

1. Splitting the data into groups based on some criteria
2. Applying a function to each group independently
3. Combining the results into a data structure


- https://pandas.pydata.org/pandas-docs/stable/reference/groupby.html
- https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html

### Structure

In [44]:
df = pd.DataFrame({'AAA': [1, 2, 8, 2],
                   'BBB': [1, 20, 30, 40],
                   'CCC': [0, 50, -30, -50]})
display(df)

grouped = df.groupby('AAA')
print(type(grouped))
print(grouped)

print('------------')

print(grouped.groups)
print(grouped.groups[8]) # indexing with group's name (dict-like)

   AAA  BBB  CCC
0    1    1    0
1    2   20   50
2    8   30  -30
3    2   40  -50

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f8118204048>
------------
{1: Int64Index([0], dtype='int64'), 2: Int64Index([1, 3], dtype='int64'), 8: Int64Index([2], dtype='int64')}
Int64Index([2], dtype='int64')

### Iteration

In [45]:
for name, data in grouped: # iterated as tuple(name, data)
    print(name)
    print(type(data), data)

1
<class 'pandas.core.frame.DataFrame'>    AAA  BBB  CCC
0    1    1    0
2
<class 'pandas.core.frame.DataFrame'>    AAA  BBB  CCC
1    2   20   50
3    2   40  -50
8
<class 'pandas.core.frame.DataFrame'>    AAA  BBB  CCC
2    8   30  -30

### Grouped by Time Period

In [46]:
dates = pd.date_range('1/10/2000', periods=60)

df = pd.DataFrame(np.random.randn(60, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])
display(df)

                   A         B         C         D
2000-01-10 -0.053004  0.859525  1.809596  0.090678
2000-01-11  1.884072  1.265207 -0.308331  0.776222
2000-01-12 -0.184556 -0.685062 -0.832683  0.036024
2000-01-13  0.853374 -0.034343  0.250563 -0.004273
2000-01-14  0.117620  0.461261  0.092277 -1.590863
2000-01-15 -0.233239  0.108077  1.212488  0.974997
2000-01-16  2.614871 -1.534948 -0.503659 -1.084930
2000-01-17  2.691070 -2.157128 -0.923915  0.846255
2000-01-18 -1.660164  1.211071 -0.951900  1.563689
2000-01-19  0.330834  0.729455  0.791820 -1.284726
2000-01-20 -0.147882 -0.291597 -0.198291  1.736325
2000-01-21 -0.525803 -2.518362  0.872642  1.149341
2000-01-22 -0.857808 -0.369226 -1.826696 -0.647982
2000-01-23  0.535179  1.180558  1.064833 -0.903686
2000-01-24 -0.379835  1.596748 -0.570942 -1.192845
2000-01-25 -0.145679  0.952283  0.500392 -0.599159
2000-01-26 -1.689343  0.118672 -1.560100  1.094482
2000-01-27  0.255230  0.513941  0.760212 -0.431570
2000-01-28 -1.973700  0.668635  0.011750 -0.136414
2000-01-29 -1.351650  1.815494  0.066526  0.501839
2000-01-30 -0.385761 -1.479565  1.180517  0.038773
2000-01-31 -0.448449 -1.230732  0.818647  1.225426
2000-02-01 -0.136867 -0.936200 -1.927860  0.222005
2000-02-02  2.137585  1.410850  0.246149 -0.391876
2000-02-03  0.019425 -2.677733  0.533535 -0.682910
2000-02-04  1.933423 -0.891457 -2.321610 -0.692143
2000-02-05 -1.491717  0.402417 -1.732624 -0.625343
2000-02-06  0.432839  0.622445  1.288251  0.290228
2000-02-07  0.375732  0.005009 -0.510012  1.760066
2000-02-08 -1.550847 -0.609671  0.766545  1.031357
2000-02-09  0.519435  1.709632  0.652479 -0.921089
2000-02-10 -0.326912 -0.166177  0.635874 -1.128331
2000-02-11 -1.402272  0.033975  1.462567 -0.339161
2000-02-12  0.358844 -0.413329  0.540999  1.042653
2000-02-13 -0.875411 -1.846247 -1.301429  0.191382
2000-02-14  0.394531 -0.486767 -0.016689  2.043089
2000-02-15 -0.488275  0.587089 -0.496998  0.100091
2000-02-16 -0.863782 -0.104509 -0.995894  1.607202
2000-02-17 -0.330626  0.298538  0.971986 -0.332233
2000-02-18  0.623385 -0.019538  0.318866 -0.286598
2000-02-19 -0.232695  1.295373 -0.184120 -0.561504
2000-02-20 -0.768976 -1.276407 -1.237424 -0.964170
2000-02-21 -0.510765  0.610756  1.330402 -1.459755
2000-02-22 -0.656613 -0.111964 -1.018812  0.041647
2000-02-23 -0.744708  1.689704  0.813591 -0.810202
2000-02-24  0.361216 -0.745847 -0.110570 -1.853353
2000-02-25  0.435588  0.693702  1.119464  1.274155
2000-02-26  0.131885  0.227568 -0.577521 -0.015865
2000-02-27  1.260227 -0.845407 -0.414178  1.400799
2000-02-28 -1.526250  1.498622 -1.651416 -0.317450
2000-02-29  0.708126 -1.089429 -0.522217  0.228581
2000-03-01  0.485357 -0.010754  0.264842 -0.666264
2000-03-02  2.112886 -1.168591  0.111912  2.117723
2000-03-03 -0.402897  0.883406  0.509037  0.018466
2000-03-04  0.334206  0.473119  0.450473  0.735022
2000-03-05  0.568096  0.929804  1.288131  0.758872
2000-03-06  1.335142 -1.110787 -1.093882  0.174977
2000-03-07 -0.457970 -0.307548  0.415084  1.789361
2000-03-08 -0.329789  0.166415  0.862301 -1.022152
2000-03-09  0.787263  0.539727 -1.114361  1.383258

In [47]:
for name, data in df.groupby(pd.Grouper(freq='M')): # or '1M'
    print('\n', name)
    print(data)

 2000-01-31 00:00:00
                   A         B         C         D
2000-01-10 -0.053004  0.859525  1.809596  0.090678
2000-01-11  1.884072  1.265207 -0.308331  0.776222
2000-01-12 -0.184556 -0.685062 -0.832683  0.036024
2000-01-13  0.853374 -0.034343  0.250563 -0.004273
2000-01-14  0.117620  0.461261  0.092277 -1.590863
2000-01-15 -0.233239  0.108077  1.212488  0.974997
2000-01-16  2.614871 -1.534948 -0.503659 -1.084930
2000-01-17  2.691070 -2.157128 -0.923915  0.846255
2000-01-18 -1.660164  1.211071 -0.951900  1.563689
2000-01-19  0.330834  0.729455  0.791820 -1.284726
2000-01-20 -0.147882 -0.291597 -0.198291  1.736325
2000-01-21 -0.525803 -2.518362  0.872642  1.149341
2000-01-22 -0.857808 -0.369226 -1.826696 -0.647982
2000-01-23  0.535179  1.180558  1.064833 -0.903686
2000-01-24 -0.379835  1.596748 -0.570942 -1.192845
2000-01-25 -0.145679  0.952283  0.500392 -0.599159
2000-01-26 -1.689343  0.118672 -1.560100  1.094482
2000-01-27  0.255230  0.513941  0.760212 -0.431570
2000-01-28 -1.973700  0.668635  0.011750 -0.136414
2000-01-29 -1.351650  1.815494  0.066526  0.501839
2000-01-30 -0.385761 -1.479565  1.180517  0.038773
2000-01-31 -0.448449 -1.230732  0.818647  1.225426

 2000-02-29 00:00:00
                   A         B         C         D
2000-02-01 -0.136867 -0.936200 -1.927860  0.222005
2000-02-02  2.137585  1.410850  0.246149 -0.391876
2000-02-03  0.019425 -2.677733  0.533535 -0.682910
2000-02-04  1.933423 -0.891457 -2.321610 -0.692143
2000-02-05 -1.491717  0.402417 -1.732624 -0.625343
2000-02-06  0.432839  0.622445  1.288251  0.290228
2000-02-07  0.375732  0.005009 -0.510012  1.760066
2000-02-08 -1.550847 -0.609671  0.766545  1.031357
2000-02-09  0.519435  1.709632  0.652479 -0.921089
2000-02-10 -0.326912 -0.166177  0.635874 -1.128331
2000-02-11 -1.402272  0.033975  1.462567 -0.339161
2000-02-12  0.358844 -0.413329  0.540999  1.042653
2000-02-13 -0.875411 -1.846247 -1.301429  0.191382
2000-02-14  0.394531 -0.486767 -0.016689  2.043089
2000-02-15 -0.488275  0.587089 -0.496998  0.100091
2000-02-16 -0.863782 -0.104509 -0.995894  1.607202
2000-02-17 -0.330626  0.298538  0.971986 -0.332233
2000-02-18  0.623385 -0.019538  0.318866 -0.286598
2000-02-19 -0.232695  1.295373 -0.184120 -0.561504
2000-02-20 -0.768976 -1.276407 -1.237424 -0.964170
2000-02-21 -0.510765  0.610756  1.330402 -1.459755
2000-02-22 -0.656613 -0.111964 -1.018812  0.041647
2000-02-23 -0.744708  1.689704  0.813591 -0.810202
2000-02-24  0.361216 -0.745847 -0.110570 -1.853353
2000-02-25  0.435588  0.693702  1.119464  1.274155
2000-02-26  0.131885  0.227568 -0.577521 -0.015865
2000-02-27  1.260227 -0.845407 -0.414178  1.400799
2000-02-28 -1.526250  1.498622 -1.651416 -0.317450
2000-02-29  0.708126 -1.089429 -0.522217  0.228581

 2000-03-31 00:00:00
                   A         B         C         D
2000-03-01  0.485357 -0.010754  0.264842 -0.666264
2000-03-02  2.112886 -1.168591  0.111912  2.117723
2000-03-03 -0.402897  0.883406  0.509037  0.018466
2000-03-04  0.334206  0.473119  0.450473  0.735022
2000-03-05  0.568096  0.929804  1.288131  0.758872
2000-03-06  1.335142 -1.110787 -1.093882  0.174977
2000-03-07 -0.457970 -0.307548  0.415084  1.789361
2000-03-08 -0.329789  0.166415  0.862301 -1.022152
2000-03-09  0.787263  0.539727 -1.114361  1.383258

In [48]:
for name, data in df.groupby(pd.Grouper(freq='30d')):
    print('\n', name)
    print(data)

 2000-01-10 00:00:00
                   A         B         C         D
2000-01-10 -0.053004  0.859525  1.809596  0.090678
2000-01-11  1.884072  1.265207 -0.308331  0.776222
2000-01-12 -0.184556 -0.685062 -0.832683  0.036024
2000-01-13  0.853374 -0.034343  0.250563 -0.004273
2000-01-14  0.117620  0.461261  0.092277 -1.590863
2000-01-15 -0.233239  0.108077  1.212488  0.974997
2000-01-16  2.614871 -1.534948 -0.503659 -1.084930
2000-01-17  2.691070 -2.157128 -0.923915  0.846255
2000-01-18 -1.660164  1.211071 -0.951900  1.563689
2000-01-19  0.330834  0.729455  0.791820 -1.284726
2000-01-20 -0.147882 -0.291597 -0.198291  1.736325
2000-01-21 -0.525803 -2.518362  0.872642  1.149341
2000-01-22 -0.857808 -0.369226 -1.826696 -0.647982
2000-01-23  0.535179  1.180558  1.064833 -0.903686
2000-01-24 -0.379835  1.596748 -0.570942 -1.192845
2000-01-25 -0.145679  0.952283  0.500392 -0.599159
2000-01-26 -1.689343  0.118672 -1.560100  1.094482
2000-01-27  0.255230  0.513941  0.760212 -0.431570
2000-01-28 -1.973700  0.668635  0.011750 -0.136414
2000-01-29 -1.351650  1.815494  0.066526  0.501839
2000-01-30 -0.385761 -1.479565  1.180517  0.038773
2000-01-31 -0.448449 -1.230732  0.818647  1.225426
2000-02-01 -0.136867 -0.936200 -1.927860  0.222005
2000-02-02  2.137585  1.410850  0.246149 -0.391876
2000-02-03  0.019425 -2.677733  0.533535 -0.682910
2000-02-04  1.933423 -0.891457 -2.321610 -0.692143
2000-02-05 -1.491717  0.402417 -1.732624 -0.625343
2000-02-06  0.432839  0.622445  1.288251  0.290228
2000-02-07  0.375732  0.005009 -0.510012  1.760066
2000-02-08 -1.550847 -0.609671  0.766545  1.031357

 2000-02-09 00:00:00
                   A         B         C         D
2000-02-09  0.519435  1.709632  0.652479 -0.921089
2000-02-10 -0.326912 -0.166177  0.635874 -1.128331
2000-02-11 -1.402272  0.033975  1.462567 -0.339161
2000-02-12  0.358844 -0.413329  0.540999  1.042653
2000-02-13 -0.875411 -1.846247 -1.301429  0.191382
2000-02-14  0.394531 -0.486767 -0.016689  2.043089
2000-02-15 -0.488275  0.587089 -0.496998  0.100091
2000-02-16 -0.863782 -0.104509 -0.995894  1.607202
2000-02-17 -0.330626  0.298538  0.971986 -0.332233
2000-02-18  0.623385 -0.019538  0.318866 -0.286598
2000-02-19 -0.232695  1.295373 -0.184120 -0.561504
2000-02-20 -0.768976 -1.276407 -1.237424 -0.964170
2000-02-21 -0.510765  0.610756  1.330402 -1.459755
2000-02-22 -0.656613 -0.111964 -1.018812  0.041647
2000-02-23 -0.744708  1.689704  0.813591 -0.810202
2000-02-24  0.361216 -0.745847 -0.110570 -1.853353
2000-02-25  0.435588  0.693702  1.119464  1.274155
2000-02-26  0.131885  0.227568 -0.577521 -0.015865
2000-02-27  1.260227 -0.845407 -0.414178  1.400799
2000-02-28 -1.526250  1.498622 -1.651416 -0.317450
2000-02-29  0.708126 -1.089429 -0.522217  0.228581
2000-03-01  0.485357 -0.010754  0.264842 -0.666264
2000-03-02  2.112886 -1.168591  0.111912  2.117723
2000-03-03 -0.402897  0.883406  0.509037  0.018466
2000-03-04  0.334206  0.473119  0.450473  0.735022
2000-03-05  0.568096  0.929804  1.288131  0.758872
2000-03-06  1.335142 -1.110787 -1.093882  0.174977
2000-03-07 -0.457970 -0.307548  0.415084  1.789361
2000-03-08 -0.329789  0.166415  0.862301 -1.022152
2000-03-09  0.787263  0.539727 -1.114361  1.383258

### Group + Apply

In [49]:
dates = pd.date_range('1/10/2000', periods=60)
df = pd.DataFrame(np.random.randn(60, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])

grouped = df.groupby(pd.Grouper(freq='1M'))
sr = grouped.apply(lambda x: sum(x['B']))
display(sr)

2000-01-31    -5.924303
2000-02-29    14.534360
2000-03-31    -1.949768
Freq: M, dtype: float64

In [50]:
sr.index = sr.index.map(lambda x: str(x)[:7])
display(sr)

2000-01    -5.924303
2000-02    14.534360
2000-03    -1.949768
dtype: float64

# Missing Data

https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html

- pd.NaT
- np.nan
- isna()
- fillna()

# Performance 

http://pandas.pydata.org/pandas-docs/stable/user_guide/enhancingperf.html

pandas is fast. Many of the low-level algorithmic bits have been extensively tweaked in Cython code. However, as with anything else generalization usually sacrifices performance. So if you focus on one feature for your application you may be able to create a faster specialized tool.

## Time

### Dependencies

https://pandas.pydata.org/pandas-docs/stable/install.html#recommended-dependencies

- numexpr
- bottlenect

### Use Wisely

https://engineering.upside.com/a-beginners-guide-to-optimizing-pandas-code-for-speed-c09ef2c6a4d6

- Avoid loops; they’re slow and, in most common use cases, unnecessary.
- If you must loop, use `.apply()`, not iteration functions. 
- Vectorization is usually better than scalar operations. Most common operations in Pandas can be vectorized.
- **Vector operations on NumPy arrays are more efficient than on native Pandas series.**

https://realpython.com/fast-flexible-pandas/

1. **Use vectorized operations: Pandas methods and functions with no for-loops.**
2. **Use the `.apply()` method with a callable.**
3. **Use `.itertuples()`: iterate over DataFrame rows as namedtuples from Python’s collections module.**
4. **Use `.iterrows()`: iterate over DataFrame rows as (index, pd.Series) pairs.** While a Pandas Series is a flexible data structure, it can be costly to construct each row into a Series and then access it.
5. Use “element-by-element” for loops, updating each cell or row one at a time with `df.loc` or `df.iloc`. (Or, `.at`/`.iat` for fast scalar access.)

---

1. Try to use vectorized operations where possible rather than approaching problems with the `for x in df`... mentality. If your code is home to a lot of for-loops, it might be better suited to working with native Python data structures, because Pandas otherwise comes with a lot of overhead.
2. If you have more complex operations where vectorization is simply impossible or too difficult to work out efficiently, use the `.apply()` method.
3. If you do have to loop over your array (which does happen), use `.iterrows()` or `.itertuples()` to improve speed and syntax.
4. **Pandas has a lot of optionality**, and there are almost always several ways to get from A to B. Be mindful of this, compare how different routes perform, and choose the one that works best in the context of your project.
5. Once you’ve got a data cleaning script built, avoid reprocessing by storing your intermediate results with HDFStore.
6. Integrating NumPy into Pandas operations can often improve speed and simplify syntax.

https://www.dataquest.io/blog/pandas-big-data/

1. **Downcasting numeric columns to more efficient types**.
2. **Converting string columns to the categorical type**.

### Parallelize

http://blog.adeel.io/2016/11/06/parallelize-pandas-map-or-apply/

### Cython / Numba / pandas.eval()

https://pandas.pydata.org/pandas-docs/stable/user_guide/enhancingperf.html

## Space

https://towardsdatascience.com/why-and-how-to-use-pandas-with-large-data-9594dda2ea4c

1. chunking
2. drop useless columns